DataProcessors/УправлениеАрдуиной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>УправлениеАрдуиной</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтроллерАКБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/COM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>COM</Name>
			<Comment>обмен командами с КОМ портами через серверный сеанс</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аргумент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветСтатус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветАргумент1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветАргумент2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомандаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерCOMПорта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/NET.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>NET</Name>
			<Comment>обмен командами с сетевыми  устройствами через серверный сеанс</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аргумент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопАргументNET</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветСтатус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветАргумент1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветАргумент2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтветДопАргументNET</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомандаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВПроцессеОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АдресПорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/УправлениеАрдуиной/Forms/УправлениеАрдуиной/Ext/Form/Module.bsl
&НаСервере
Процедура ОткрытьПортНаСервере()	
	к.ОткрытьCOMПорт(НомерПортаАдрес, 115200);	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПорт(Команда)
	ОткрытьПортНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьПортНаСервере()
	к.ЗакрытьCOMПорт(НомерПортаАдрес);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПорт(Команда)
	ЗакрытьПортНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерезапуститьСлужбуСервераНаСервере()
	К.ПерезапуститьАгентСервера1С();
КонецПроцедуры


&НаКлиенте
Процедура ПерезапуститьСлужбуСервера(Команда)
	ПерезапуститьСлужбуСервераНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПерезагрузитьСерверНаСервере()
	К.ПерезагрузитьСервер1С();
КонецПроцедуры


&НаКлиенте
Процедура ПерезагрузитьСервер(Команда)
	ПерезагрузитьСерверНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОтправитьКомандуНаСервере()
	Ответ = К.ВыполнитьКоманду(НомерПортаАдрес, НомерПина, НомерКоманды, Аргумент, ДопАргумент);
	ОтветСтатус = Ответ.ОтветСтатус;
	ОтветАргумент1 = Ответ.ОтветАргумент1;
    ОтветАргумент2 = Ответ.ОтветАргумент2;
	ОтветДопАргумент = Ответ.ОтветДопАргументNET; 
	КомандаВыполнена = Ответ.КомандаВыполнена;
	Ошибка = Ответ.Ошибка;

КонецПроцедуры


&НаКлиенте
Процедура ОтправитьКоманду(Команда)
	ОтправитьКомандуНаСервере();
КонецПроцедуры


&НаСервере
Процедура HIGHНаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа3, 1);
КонецПроцедуры


&НаКлиенте
Процедура HIGH(Команда)
	HIGHНаСервере();
КонецПроцедуры


&НаСервере
Процедура LOWНаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа3, 0);
КонецПроцедуры


&НаКлиенте
Процедура LOW(Команда)
	LOWНаСервере();
КонецПроцедуры


&НаСервере
Процедура LOW1НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа4, 0);
КонецПроцедуры


&НаКлиенте
Процедура LOW1(Команда)
	LOW1НаСервере();
КонецПроцедуры


&НаСервере
Процедура HIGH1НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа4, 1);
КонецПроцедуры


&НаКлиенте
Процедура HIGH1(Команда)
	HIGH1НаСервере();
КонецПроцедуры


&НаСервере
Процедура digitalReadНаСервере()
	ОтветГруппа5 = К._pinModeINPUT_digitalRead(НомерПортаАдрес, НомерПинаГруппа5);
КонецПроцедуры


&НаКлиенте
Процедура digitalRead(Команда)
	digitalReadНаСервере();
КонецПроцедуры


&НаСервере
Процедура LOW2НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа6, 0);
КонецПроцедуры


&НаКлиенте
Процедура LOW2(Команда)
	LOW2НаСервере();
КонецПроцедуры


&НаСервере
Процедура HIGH2НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа6, 1);
КонецПроцедуры


&НаКлиенте
Процедура HIGH2(Команда)
	HIGH2НаСервере();
КонецПроцедуры


&НаСервере
Процедура LOW3НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа7, 0);
КонецПроцедуры


&НаКлиенте
Процедура LOW3(Команда)
	LOW3НаСервере();
КонецПроцедуры


&НаСервере
Процедура HIGH3НаСервере()
	К._pinModeOUTPUT_digitalWrite(НомерПортаАдрес, НомерПинаГруппа7, 1);	
КонецПроцедуры


&НаКлиенте
Процедура HIGH3(Команда)
	HIGH3НаСервере();
КонецПроцедуры


&НаСервере
Процедура analogReadНаСервере()
	ОтветГруппа8 = К.analogRead(НомерПортаАдрес, НомерПинаГруппа8);
КонецПроцедуры


&НаКлиенте
Процедура analogRead(Команда)
	analogReadНаСервере();
КонецПроцедуры


&НаСервере
Процедура analogWrite9НаСервере()
	К.analogWrite(НомерПортаАдрес, НомерПинаГруппа9, Аргумент9);
КонецПроцедуры


&НаКлиенте
Процедура analogWrite9(Команда)
	analogWrite9НаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Аргумент10ПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("Аргумент10ПриИзмененииНаКлиенте",1,Истина);
КонецПроцедуры
&НаКлиенте
Процедура Аргумент10ПриИзмененииНаКлиенте()
	
	Аргумент10ПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура Аргумент10ПриИзмененииНаСервере()
	
	ЗаписатьКомандуanalogWriteВРегистрСведений(НомерПинаГруппа10, Аргумент10);
	
КонецПроцедуры

Процедура ЗаписатьКомандуanalogWriteВРегистрСведений(нПина, чАргумент)
	
	Если ТипЗнч(НомерПортаАдрес) = Тип("Число") Тогда // Команда в COM порт
		Менеджер = РегистрыСведений.COM.СоздатьМенеджерЗаписи();
		Менеджер.НомерCOMПорта = НомерПортаАдрес;
	ИначеЕсли ТипЗнч(НомерПортаАдрес) = Тип("Строка") Тогда // Команда на сетевой адрес
		Менеджер = РегистрыСведений.NET.СоздатьМенеджерЗаписи();
		Менеджер.АдресПорт = НомерПортаАдрес;
	Иначе
		Возврат;
	КонецЕсли;
	
		
		Менеджер.НомерПина = нПина;
		Менеджер.Команда = 4;
		Менеджер.Аргумент = чАргумент;	
		Менеджер.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Аргумент11ПриИзменении(Элемент)
	Аргумент11ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Аргумент11ПриИзмененииНаСервере()
	
	ЗаписатьКомандуanalogWriteВРегистрСведений(НомерПинаГруппа11, Аргумент11);

КонецПроцедуры

&НаКлиенте
Процедура Аргумент12ПриИзменении(Элемент)
	Аргумент12ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Аргумент12ПриИзмененииНаСервере()
	ЗаписатьКомандуanalogWriteВРегистрСведений(НомерПинаГруппа12, Аргумент12);
КонецПроцедуры
